WELCOME = """🏀 ПИК - баскетбольный челлендж

Выполняй уникальные задания, зарабатывай очки, соревнуйся с друзьями и продвигайся по общей турнирной таблице!

🏆 Выполнил - получаешь +1 балл за карту.
💀 Не выполнил - карта идёт в сброс
⏱️ Некоторые задания со временем, будь внимателен

Вся игра проходит на одном телефоне. И не забудь поставить уникальный ник игрока, чтобы выделиться в общей таблице. Удачи 🍀"""

CHOOSE_DIFFICULTY = "🏀 Выберите режим игры:"
CHOOSE_PLAYERS = "👥 Сколько игроков?"
ASK_PLAYER_NAME = "👤 Введите уникальный никнейм игрока №{number}:"
YOUR_TURN = "🏀 ХОД ИГРОКА\n\n🔥 {player}\n\nПередайте телефон игроку {player}."
CARD_OPENED = "🃏 КАРТОЧКА ОТКРЫТА\n\n🔥 Игрок: {player}\n⏱ Время: {seconds} \n\nНе начинайте выполнение, пока не нажмёте кнопку."
TIMER = "🔥 {player}, ВПЕРЁД!\n\n⏱ Лимит: {seconds} сек. \n\nКогда закончишь — нажми результат."
SUCCESS = "😎 КРАСАВЧИК!\n\n{player} выполнил задание!\n\n🏆 +1 очко"
FAIL = "💀 ЛУЗЕР!\n\n{player} не выполнил задание."
TIMEOUT = "⏰ ВРЕМЯ ВЫШЛО!\n\n{player} не успел.\n\n💀 Лузер."
RESULTS = "🏆 ИГРА ОКОНЧЕНА!\n\nПобедитель: {winner}\n\n{ranking}"
STATS = "📊 СТАТИСТИКА ТЕКУЩЕЙ ИГРЫ\n\n{stats}"
OVERALL_STATS = "{stats}"
RESTART = "🔄 Начать новую игру?\n\nТекущий прогресс будет потерян."
